Repository: xiepixie/SparkleRecorder
Catalog: Sources/SparkleRecorder/Automation.xcstrings
Source language: en
Languages: zh_hans

source: Every day
zh_hans: 每天

source: Keep SparkleRecorder open so this run can start on time.
zh_hans: 请保持 SparkleRecorder 运行，以便按时开始。

source: Run at
zh_hans: 运行时间

source: Run automatically
zh_hans: 定时运行

source: Run automatically…
zh_hans: 定时运行…

source: Run every day
zh_hans: 设为每天运行

source: Automatic run scheduled.
zh_hans: 已安排自动运行。

source: Scheduled. Next run: %@
zh_hans: 已安排，下次运行：%@

source: %@, %d tasks, %d dependencies
zh_hans: %@，%d 个任务，%d 条依赖

source: %d dependent edges will be removed
zh_hans: 将移除 %d 条关联连线

source: %d older runs hidden
zh_hans: 已隐藏 %d 条更早运行

source: %d queued to run
zh_hans: %d 个准备执行

source: %d running, %d waiting
zh_hans: %d 个运行中，%d 个等待中

source: %d tasks
zh_hans: %d 个任务

source: %d tasks cancelled
zh_hans: %d 个任务已取消

source: %d tasks need attention
zh_hans: %d 个任务需要处理

source: %d tasks waiting for first run
zh_hans: %d 个任务等待首次运行

source: %d waiting for upstream tasks or resources
zh_hans: %d 个正在等待上游任务或资源

source: %d x %d px · Original pixels
zh_hans: %d x %d px · 原始像素

source: > 1× slower · < 1× faster.
zh_hans: > 1× 变慢 · < 1× 变快。

source: A free-form scratchpad attached to %@.
zh_hans: “%@”的自由备注区。

source: A long delay may be better as a Wait Text condition when the screen changes.
zh_hans: 在屏幕内容发生变化时，长等待最好替换为文本等待条件。

source: ADD CONDITION
zh_hans: 添加条件

source: Add %@ as task
zh_hans: 将 %@ 添加为任务

source: Add another task to create a link
zh_hans: 再添加一个任务后可创建连线

source: Add macro as task
zh_hans: 将宏添加为任务

source: Adds a pause at the selected position (or end if none selected).
zh_hans: 在选中位置插入一段暂停（如果未选中，则插在末尾）。

source: All tasks completed
zh_hans: 所有任务已完成

source: Applied patch: %d task changes, %d dependency changes.
zh_hans: 已应用补丁：%d 个任务变更，%d 条依赖变更。

source: Apply Dependency
zh_hans: 应用依赖

source: Apply Workflow Draft Patch
zh_hans: 应用工作流草稿补丁

source: Apply workflow draft patch
zh_hans: 应用工作流草稿补丁

source: Approve automation task "%@"?
zh_hans: 确认运行自动化任务“%@”？

source: Automation
zh_hans: 自动化

source: Automation workflows will appear here after the reducer projection is connected.
zh_hans: 连接自动化数据后，工作流会显示在这里。

source: BRANCHES
zh_hans: 分支

source: CONDITION
zh_hans: 条件

source: CONDITION BLOCKS
zh_hans: 条件块

source: Cancel Run
zh_hans: 取消运行

source: Cancel run
zh_hans: 取消运行

source: Cancel the current run
zh_hans: 取消当前运行

source: Capturing workflow task
zh_hans: 正在捕获工作流任务

source: Change the behavior name before applying Rename.
zh_hans: 请先修改行为名称，再应用重命名。

source: Checks the text condition once. Playback stops if the condition is not met.
zh_hans: 检查一次文本条件；不满足时停止回放。

source: Choose a stretch factor greater than 0.
zh_hans: 请选择大于 0 的拉伸倍率。

source: Choose a stretch factor other than 1.00x.
zh_hans: 请选择不等于 1.00x 的拉伸倍率。

source: Compiled tasks
zh_hans: 已生成任务

source: Condition
zh_hans: 条件

source: Condition details missing
zh_hans: 缺少条件详情

source: Condition did not match
zh_hans: 条件未匹配

source: Condition matched
zh_hans: 条件已匹配

source: Condition name
zh_hans: 条件名称

source: Condition not matched
zh_hans: 条件未匹配

source: Condition source
zh_hans: 条件来源

source: Condition type
zh_hans: 条件类型

source: Condition wait
zh_hans: 条件等待

source: Connect task
zh_hans: 连接任务

source: Copy this behavior as a new reusable behavior block.
zh_hans: 将这个行为复制成新的可复用行为块。

source: Create a reusable behavior macro and preview the Repeat-Until workflow draft.
zh_hans: 创建可复用的行为宏，并预览 Repeat-Until 工作流草稿。

source: Create a workflow to edit automation settings.
zh_hans: 创建工作流后即可编辑自动化设置。

source: Create a workflow to edit workflow details.
zh_hans: 创建一个工作流以编辑工作流详情。

source: Create a workflow to start arranging macros and conditions.
zh_hans: 创建工作流后即可编排宏和条件。

source: Create a workflow to view workflow details.
zh_hans: 创建一个工作流以查看工作流详情。

source: Create an automation workflow to see it in this list.
zh_hans: 创建自动化工作流后，它会出现在此列表中。

source: Current run is active
zh_hans: 当前运行中

source: Cycle detected at task %@
zh_hans: 检测到循环依赖：任务 %@

source: DEPENDENCY
zh_hans: 依赖

source: DEPENDENCY ID MAP
zh_hans: 依赖 ID 映射

source: DRAFT DEPENDENCY EDIT
zh_hans: 草稿连线编辑

source: DRAFT TASK REMOVE
zh_hans: 草稿任务删除

source: DRAFT TASKS
zh_hans: 草稿任务

source: Delete Dependency
zh_hans: 删除依赖

source: Delete Task
zh_hans: 删除任务

source: Delete Workflow
zh_hans: 删除工作流

source: Dependency
zh_hans: 依赖

source: Dependency %@ loops back to task %@
zh_hans: 依赖 %@ 会形成回路并返回任务 %@

source: Dependency %@ references missing source task %@
zh_hans: 依赖 %@ 引用了不存在的源任务 %@

source: Dependency %@ references missing target task %@
zh_hans: 依赖 %@ 引用了不存在的目标任务 %@

source: Dependency section
zh_hans: 依赖设置区域

source: Draft-only loop; imported workflow stays acyclic
zh_hans: 循环只存在于草稿层；导入后的工作流仍是无环图

source: Drag to move task
zh_hans: 拖动以移动任务

source: Draw Region records bounds on the display where you drag. Use this when the automation should stay tied to that monitor.
zh_hans: 框选区域会记录拖拽所在显示器的边界。适合需要固定在该显示器上的自动化。

source: Draw Region records display-pixel bounds. Use this when the automation should inspect a fixed screen area.
zh_hans: 框选区域会记录显示器像素边界。适合需要检查固定屏幕区域的自动化。

source: Drop macro to create task
zh_hans: 释放以创建任务

source: Dry-run
zh_hans: 预检

source: Dry-run passed
zh_hans: 预检通过

source: Duplicate dependency ID %@
zh_hans: 依赖 ID %@ 重复

source: Duplicate task ID %@
zh_hans: 任务 ID %@ 重复

source: Edit Source Condition
zh_hans: 编辑源条件

source: Edits apply live · use Save to persist
zh_hans: 修改会立即生效 · 点“保存”写入文件

source: Else branch
zh_hans: 否则分支

source: Enable the task before running
zh_hans: 先启用任务再运行

source: Enter a behavior name before renaming.
zh_hans: 请先输入行为名称，再重命名。

source: Enter a number, or 0 (or leave blank) for continuous.
zh_hans: 输入次数；输入 0 或留空表示持续循环。

source: Enter a timeout of 0 or greater.
zh_hans: 请输入大于或等于 0 的超时时长。

source: Enter a valid key code.
zh_hans: 请输入有效的按键码。

source: Enter a valid time or duration of 0 or greater.
zh_hans: 请输入大于或等于 0 的有效时间或时长。

source: Evidence
zh_hans: 证据

source: Evidence available
zh_hans: 有可用证据

source: Evidence binding
zh_hans: 证据关联

source: Evidence cancelled
zh_hans: 证据已取消

source: Evidence issue
zh_hans: 证据发生问题

source: Evidence off
zh_hans: 证据已关闭

source: Evidence on
zh_hans: 证据已开启

source: Evidence stopped for privacy
zh_hans: 已为保护隐私停止证据采集

source: Evidence ready
zh_hans: 证据已就绪

source: Evidence recording
zh_hans: 证据录制中

source: Evidence saved
zh_hans: 证据已保存

source: Export All Workflows
zh_hans: 导出全部工作流

source: Export Workflow
zh_hans: 导出工作流

source: Export Workflow Package
zh_hans: 导出工作流包

source: Exported %@ with %d tasks and %d dependencies to %@.
zh_hans: 已导出 %@，包含 %d 个任务和 %d 条依赖，文件为 %@。

source: FLOWGRAPH
zh_hans: 流程图

source: Failed run
zh_hans: 运行失败

source: IMPORT DRY-RUN
zh_hans: 导入预检

source: Import Workflow
zh_hans: 导入工作流

source: Import Workflow Package
zh_hans: 导入工作流包

source: Import the reviewed workflow draft
zh_hans: 导入已检查的工作流草稿

source: Insert after selection, ending at #%d
zh_hans: 插入到选中范围之后（结束于 #%d）

source: Inspect task
zh_hans: 检查任务

source: Inspector inputs are ready to apply.
zh_hans: 检查器输入可以应用。

source: Keep Running
zh_hans: 继续运行

source: LINK TRIGGER
zh_hans: 链接触发

source: Loop needs a repeat count and body tasks before import
zh_hans: 循环需要重复次数和循环体步骤后才能导入

source: Manual or scheduled runs will appear here with timing, outcome, and evidence.
zh_hans: 手动或计划运行会在这里显示时间、结果和证据。

source: May use mouse and keyboard
zh_hans: 可能使用鼠标和键盘

source: Missing task
zh_hans: 任务缺失

source: Move task down
zh_hans: 向下移动任务

source: Move task left
zh_hans: 向左移动任务

source: Move task right
zh_hans: 向右移动任务

source: Move task up
zh_hans: 向上移动任务

source: Multiplier between 0.1× and 10×.
zh_hans: 倍率需介于 0.1× 至 10× 之间。

source: Mutates workflow after confirmation
zh_hans: 确认后修改 workflow

source: Needs pixel or watched area
zh_hans: 需要像素点或观察区域

source: New Workflow
zh_hans: 新建工作流

source: New source task
zh_hans: 新源任务

source: New workflow
zh_hans: 新建工作流

source: No baseline images in this workflow yet.
zh_hans: 这个工作流还没有基线图。

source: No compiled workflow
zh_hans: 未生成可导入工作流

source: No reference images in this workflow yet.
zh_hans: 这个工作流还没有参考图。

source: No run has started yet
zh_hans: 尚未开始运行

source: No saved watched areas in this workflow.
zh_hans: 这个工作流还没有保存的观察区域。

source: No semantic recording link was found for this macro or run; choose a bundle before reviewing frames, OCR, or visual evidence.
zh_hans: 当前宏或本次运行没有关联语义录制；请先选择一个记录包，再审阅画面、OCR 或视觉证据。

source: No task nodes
zh_hans: 无任务节点

source: No task runs yet
zh_hans: 还没有任务运行记录

source: No task selected
zh_hans: 未选择任务

source: No tasks in draft
zh_hans: 草稿中没有任务

source: No tasks in workflow
zh_hans: 工作流中没有任务

source: No workflow mutation
zh_hans: 不修改 workflow

source: No workflow selected
zh_hans: 未选择工作流

source: No workflows
zh_hans: 暂无工作流

source: Not run
zh_hans: 未运行

source: Once, N times, or forever — at any speed.
zh_hans: 一次、多次、无限循环，速度随你调。

source: Open AI workflow draft
zh_hans: 打开 AI 工作流草稿

source: Open Workflow Draft
zh_hans: 打开工作流草稿

source: Open Workflow to import
zh_hans: 打开 Workflow 后导入

source: Open a SparkleRecorder window before sharing a workflow package.
zh_hans: 请先打开 SparkleRecorder 窗口，再分享工作流包。

source: Open a semantic recording bundle for frame timeline, visual evidence, region selection, and review-only draft patch generation.
zh_hans: 打开一个语义录制包，查看画面时间线、视觉证据、选择区域，并生成仅供审阅的草稿补丁。

source: Open the semantic recording captured with %@. It includes %d timeline events; this run does not carry a separate semantic bundle yet.
zh_hans: 打开随 %@ 捕获的语义录制。它包含 %d 个时间线事件；本次运行还没有单独绑定语义 bundle。

source: Opening Macro Review never mutates the workflow; reviewed changes still need Draft Preview and confirmed import.
zh_hans: 打开“宏审阅”不会直接修改工作流；审阅后的更改仍需先预览草稿并确认导入。

source: Preparing evidence
zh_hans: 准备证据中

source: Press F-key to play %@ from any app.
zh_hans: 按功能键即可在任意 App 中播放“%@”。

source: Press any key combination to play %@ from any app.
zh_hans: 按任意组合键即可在任意 App 中播放“%@”。

source: Queued to run
zh_hans: 已排队等待运行

source: RUN CONTROL
zh_hans: 运行控制

source: RUN HISTORY
zh_hans: 运行历史

source: RUN MODEL
zh_hans: 运行模式

source: Read a duration from the source condition evidence and use the delay field as fallback.
zh_hans: 从上游条件证据读取时长，并把延迟字段作为回退。

source: Record a macro before adding automation tasks.
zh_hans: 先录制一个宏，再添加自动化任务。

source: Record a repeatable task, then review or combine it in a workflow.
zh_hans: 录制一个可重复的任务，然后在工作流中进行审阅或组合。

source: Record visual evidence
zh_hans: 录制视觉证据

source: Recorded task
zh_hans: 已录制任务

source: Refresh automation projection
zh_hans: 刷新自动化视图

source: Refreshing automation projection
zh_hans: 正在刷新自动化视图

source: Remove Task
zh_hans: 移除任务

source: Remove Task?
zh_hans: 移除任务？

source: Removed %@ and %d dependent edges from this draft preview.
zh_hans: 已从草稿预览移除 %@ 和 %d 条关联连线。

source: Repeat-Until drafts from Macro Editor stay in preview until structured loop runtime support lands.
zh_hans: 来自宏编辑器的 Repeat-Until 草稿会停留在预览中，直到结构化循环运行时支持落地。

source: Repeat-until needs an until condition before import
zh_hans: “重复直到”在导入前需要设置结束条件

source: Repeat-until, foreach, and runtime loop evidence are not active yet
zh_hans: repeat-until、foreach 和运行时循环证据尚未启用

source: Replace Workflow
zh_hans: 替换工作流

source: Replace the existing workflow with this reviewed draft
zh_hans: 用已检查的草稿替换现有工作流

source: Required resources are locked by this task type.
zh_hans: 此任务类型所需的资源已锁定。

source: Resolve workflow validation errors before exporting an AI-editable draft.
zh_hans: 请先解决工作流校验错误，再导出 AI 可编辑草稿。

source: Run
zh_hans: 运行

source: Run %@?
zh_hans: 运行 %@？

source: Run Task
zh_hans: 运行任务

source: Run failed
zh_hans: 运行失败

source: Run outcome
zh_hans: 运行结果

source: Run task now
zh_hans: 立即运行任务

source: Run when
zh_hans: 当结果为

source: Running
zh_hans: 运行中

source: Running now
zh_hans: 正在运行

source: Runs will appear here when scheduler or manual starts create task history.
zh_hans: 任务由计划或手动启动后，运行记录会显示在这里。

source: Save Dependency
zh_hans: 保存依赖

source: Save Task
zh_hans: 保存任务

source: Save Workflow
zh_hans: 保存工作流

source: Saving evidence
zh_hans: 保存证据中

source: Select a behavior body and one text wait condition.
zh_hans: 选择一个行为循环体和一个文字等待条件。

source: Select a task or dependency to inspect its properties. Use the Workflow tab for workflow configurations.
zh_hans: 选择一个任务或依赖项以检查其属性。使用“工作流”选项卡进行工作流配置。

source: Select one Wait Text, Wait Text Gone, or Verify Text condition as the Until check.
zh_hans: 选择一个等待文本、等待文本消失或验证文本条件作为「直到」检查。

source: Select one behavior to rename.
zh_hans: 请选择一个行为进行重命名。

source: Select only one Wait Text, Wait Text Gone, or Verify Text condition.
zh_hans: 仅选择一个等待文本、等待文本消失或验证文本条件。

source: Select task
zh_hans: 选择任务

source: Share All Workflows
zh_hans: 分享全部工作流

source: Share Workflow
zh_hans: 分享工作流

source: Shows the task and run details in the inspector
zh_hans: 在检查器中显示任务和运行详细信息

source: Some imported workflows already exist. Add copies to keep existing workflows, or replace matching workflows.
zh_hans: 部分导入的工作流已经存在。添加副本可保留现有工作流，也可以替换匹配的工作流。

source: Source condition
zh_hans: 源条件

source: Start dependency
zh_hans: 开始连接

source: Start this task now
zh_hans: 立即启动这个任务

source: TASK ID MAP
zh_hans: 任务 ID 映射

source: TASKS
zh_hans: 任务

source: Tag %@ to organize your library.
zh_hans: 为“%@”添加标签，方便整理宏库。

source: Tap the ★ on any card to favorite it.
zh_hans: 点按任意卡片上的 ★ 可收藏。

source: Task
zh_hans: 任务

source: Task name
zh_hans: 任务名称

source: Task removal undone.
zh_hans: 任务删除已撤回。

source: Tasks
zh_hans: 任务

source: Text condition
zh_hans: 文本条件

# That key is already assigned.
source: That shortcut is already in use. Choose a different shortcut.
zh_hans: 这个快捷键已被占用，请换一个。

source: The selected body and text condition can become a bounded loop preview.
zh_hans: 所选的循环体和文本条件可以生成循环预览。

source: The selected bundle is not proven to belong to this run, so use it for local review until S2 provides a saved-macro-linked live bundle.
zh_hans: 尚无法确认所选记录包来自本次运行，因此目前仅用于本地审阅；只有与已保存宏关联的实时记录包才能作为本次运行的证据。

source: This cancels the current run for "%@".
zh_hans: 这会取消“%@”的当前运行。

source: This edit only changes the draft preview.
zh_hans: 这个编辑只会改变草稿预览。

source: This package references %d macros that are not in your local library. The workflows can still be imported, but those tasks will show as Missing macro until you import or recreate the macros.
zh_hans: 此包引用了 %d 个当前宏库中不存在的宏。仍可导入工作流结构，但这些任务会显示为“宏缺失”，直到导入或重新创建对应宏。

source: This removes "%@" from the workflow and removes dependencies attached to it.
zh_hans: 这会从工作流中移除“%@”，并移除与它相连的依赖。

source: This removes task "%@" and %d dependent edges from the draft preview. Saved workflows are unchanged until you import.
zh_hans: 这会从草稿预览中移除任务“%@”和 %d 条关联连线。导入前，已保存 workflow 不会改变。

source: This removes the workflow with %d tasks and %d dependencies. Saved macros stay in your macro library.
zh_hans: 这会移除包含 %d 个任务和 %d 条依赖的工作流。已保存的宏仍会留在宏库中。

source: This run does not yet carry a per-run semantic bundle, so review evidence is useful for repair but not accepted as live run proof.
zh_hans: 本次运行尚未绑定独立的语义录制包；这些审阅证据可用于修复，但不能作为本次运行的正式证据。

source: This selection already contains a behavior. Rename or unbind it before creating another.
zh_hans: 当前选择已包含行为。请先重命名或拆分，再创建新的行为。

source: This starts "%@" now and may control the mouse and keyboard while it runs.
zh_hans: 这会立即启动“%@”，运行期间可能控制鼠标和键盘。

source: This starts "%@" now using its configured automation resources.
zh_hans: 这会立即启动“%@”，并使用它配置的自动化资源。

source: This will add a workflow with %d tasks and %d dependencies. It will not run until you start it.
zh_hans: 这会新增一个包含 %d 个任务和 %d 条依赖的工作流。它不会自动运行，直到你手动启动。

source: This will replace the existing workflow "%@" with %d tasks and %d dependencies. It will not run until you start it.
zh_hans: 这会将现有工作流“%@”替换为包含 %d 个任务和 %d 条依赖的版本。它不会自动运行，直到你手动启动。

source: Total Run Time:
zh_hans: 总运行时间：

source: Trigger
zh_hans: 触发

source: Trigger %@
zh_hans: 触发：%@

source: Trigger from anywhere
zh_hans: 随处触发

source: Trigger recording, stop, and play from any app — without bringing SparkleRecorder to the front. You can change these in Preferences.
zh_hans: 可在任意 App 中录制、停止和播放，无需切到 SparkleRecorder。你可以在设置中修改这些快捷键。

source: Try a different search term.
zh_hans: 换个关键词试试。

source: Undo Task Removal
zh_hans: 撤回删除任务

source: Uses the semantic recording attached to the saved macro and preselects the closest event or condition evidence when the run outcome provides a target.
zh_hans: 使用已保存宏关联的语义录制；如果运行结果包含目标，会自动定位到最接近的事件或条件证据。

source: Visual Evidence
zh_hans: 视觉证据

source: Visual evidence off
zh_hans: 视觉证据已关闭

source: Visual evidence on
zh_hans: 视觉证据已开启

source: WORKFLOWS
zh_hans: 工作流

source: Waiting for an upstream task
zh_hans: 等待上游任务

source: Workflow
zh_hans: 工作流

source: Workflow draft export blocked
zh_hans: 工作流草稿导出被阻止

source: Workflow draft exported
zh_hans: 工作流草稿已导出

source: Workflow imported
zh_hans: 工作流已导入

source: Workflow name
zh_hans: 工作流名称

source: Workflow package has conflicts
zh_hans: 工作流包存在冲突

source: Workflow package references missing macros
zh_hans: 工作流包引用了缺失的宏

source: Workflow replaced
zh_hans: 工作流已替换

source: Workflow start
zh_hans: 工作流启动

source: Workflow structure appears here.
zh_hans: 工作流结构将显示在此处。

source: Workflows
zh_hans: 工作流

source: workflow draft validate
zh_hans: 工作流草稿验证

source: workflow macros
zh_hans: 工作流宏

source: Create Workflow
zh_hans: 创建工作流

source: Create workflow
zh_hans: 创建工作流

source: Create schedule
zh_hans: 创建定时运行

source: Schedule macro
zh_hans: 定时运行宏

source: Scheduled runs require SparkleRecorder to remain open.
zh_hans: 定时运行需要 SparkleRecorder 保持打开。

source: Runs while SparkleRecorder is open
zh_hans: SparkleRecorder 打开时运行

source: Task enabled
zh_hans: 启用任务

source: Do not switch apps
zh_hans: 不要切换应用

source: Activate if running
zh_hans: 运行中则激活

source: Open if needed
zh_hans: 需要时打开

source: Keep the current application in front.
zh_hans: 保持当前应用位于前台。

source: Bring the target application forward only when it is already open.
zh_hans: 仅在目标应用已经打开时将其切到前台。

source: Open the target application and wait for its window before running.
zh_hans: 打开目标应用，并在目标窗口出现后再运行。

source: Target application
zh_hans: 目标应用

# Could not find the target application %@.
source: Could not find the target application %1$@.
zh_hans: 找不到目标应用 %1$@。

# Could not open the target application %@.
source: Could not open the target application %1$@.
zh_hans: 无法打开目标应用 %1$@。

# Timed out while opening the target application %@.
source: Timed out while opening the target application %1$@.
zh_hans: 打开目标应用 %1$@ 超时。

# The target window for %@ did not appear in time.
source: The target window for %1$@ did not appear in time.
zh_hans: %1$@ 的目标窗口未及时出现。

source: The target window does not identify an application to open.
zh_hans: 目标窗口缺少可用于打开应用的标识。

source: Every week
zh_hans: 每周

source: Interval
zh_hans: 间隔

source: After running
zh_hans: 运行结束后

source: Keep open after running
zh_hans: 保持应用打开

source: Close after running
zh_hans: 运行后关闭应用

source: Preview in 5 seconds
zh_hans: 5 秒后试跑

source: Cancel preview (%d)
zh_hans: 取消试跑（%d）

source: Starting preview…
zh_hans: 正在开始试跑…

source: Latest run
zh_hans: 最近一次运行

source: Latest run…
zh_hans: 最近一次运行…

source: No runs yet
zh_hans: 还没有运行记录

source: Preview or run this macro to create a report and ending screenshot.
zh_hans: 试跑或运行这个宏后，这里会显示报告和结束截图。

source: Completed
zh_hans: 已完成

source: The report was saved, but no ending screenshot was captured.
zh_hans: 运行报告已保存，但未能截取结束画面。

source: Show report
zh_hans: 显示报告

source: Could not load the latest run
zh_hans: 无法载入最近一次运行

source: Run result screenshot preview
zh_hans: 运行结果截图预览

source: The macro is no longer available.
zh_hans: 这个宏已不存在。

source: Stop recording or playback before previewing.
zh_hans: 请先停止录制或播放，再开始试跑。

source: Macro has no playable events.
zh_hans: 宏中没有可播放的操作。

source: Preview failed.
zh_hans: 试跑失败。

source: Preview was cancelled.
zh_hans: 试跑已取消。

source: Preview timed out.
zh_hans: 试跑超时。

source: Turn off automatic runs
zh_hans: 关闭定时运行

source: Automatic runs turned off.
zh_hans: 已关闭自动运行。

source: Edit automatic run
zh_hans: 编辑定时运行

source: Edit automatic run…
zh_hans: 编辑定时运行…

source: Next run
zh_hans: 下次运行

# Next: %@
source: Next: %1$@
zh_hans: 下次：%1$@

source: No upcoming run
zh_hans: 暂无后续运行

source: Automatic run paused
zh_hans: 定时运行已暂停

source: Multiple schedules were found. Saving will merge them into one.
zh_hans: 检测到多个重复计划，保存后会合并为一个。

source: Turn off automatic runs?
zh_hans: 关闭定时运行？

source: The macro stays in Library and can still be run manually.
zh_hans: 宏会保留在资料库中，仍可手动运行。

source: Preview completed. The result was saved to Latest run.
zh_hans: 试跑完成，结果已保存到“最近一次运行”。

source: Another foreground automation is running.
zh_hans: 另一个前台自动任务正在运行。

source: Preview could not be completed.
zh_hans: 试跑未能完成。

source: Preview completed.
zh_hans: 试跑完成。

source: Complete macro once
zh_hans: 完整运行宏一次

source: On
zh_hans: 已开启

source: Playback
zh_hans: 播放

source: Paused
zh_hans: 已暂停

source: Turn on and save
zh_hans: 开启并保存

source: Close only if opened for this run
zh_hans: 仅关闭本次自动打开的应用

source: Keep SparkleRecorder open for on-time runs. Missed runs do not stack.
zh_hans: 请保持 SparkleRecorder 运行；错过的任务不会累积补跑。

source: The macro needs a name before it can be scheduled.
zh_hans: 请先为宏命名，再创建计划。

source: The interval must be at least 1.
zh_hans: 间隔数值至少为 1。

source: Choose a future time for a one-time run.
zh_hans: 一次性运行请选择未来时间。

source: Preview ended before a result was reported.
zh_hans: 试跑已结束，但没有收到运行结果。

source: Wait before force quit
zh_hans: 强制退出前等待

source: Force quit if the app does not close
zh_hans: 应用未关闭时强制退出

source: Only the exact app process opened by this run can be force quit.
zh_hans: 只会强制退出本次运行打开的精确应用进程。

source: The run finishes after the wait even if the app stays open.
zh_hans: 等待结束后任务会完成，即使应用仍保持打开。

source: %d steps · %d attempts
zh_hans: %d 个步骤 · %d 次尝试

source: All
zh_hans: 全部

source: Attempts
zh_hans: 尝试次数

source: Automatic and workflow runs will appear here.
zh_hans: 定时运行和工作流运行会显示在这里。

source: Available
zh_hans: 可用

source: Check the target application and target window.
zh_hans: 请检查目标应用和目标窗口。

source: Choose another run filter.
zh_hans: 请选择其他运行筛选条件。

source: Confirm why the run was cancelled before restarting it.
zh_hans: 重新运行前先确认取消原因。

source: Failure focus
zh_hans: 失败卡点

source: Grant the required macOS permission, then run again.
zh_hans: 授予所需的 macOS 权限后重新运行。

source: Inspect the failed macro event and its saved evidence.
zh_hans: 检查失败的宏事件及其证据。

source: Latest activity
zh_hans: 最近活动

source: Loading runs
zh_hans: 正在加载运行记录

source: Needs attention
zh_hans: 需要处理

source: Next action
zh_hans: 下一步

source: No action is required.
zh_hans: 无需处理。

source: No matching runs
zh_hans: 没有符合条件的运行

source: None
zh_hans: 无

source: Open the saved evidence before changing the automation.
zh_hans: 修改自动化前先查看已保存的证据。

source: Open Workflow
zh_hans: 打开工作流

source: Refresh failed
zh_hans: 刷新失败

source: Refresh runs
zh_hans: 刷新运行记录

source: Restore or replace the missing macro.
zh_hans: 恢复或替换缺失的宏。

source: Review the failed task, then start a new run.
zh_hans: 检查失败任务后再开始新的运行。

source: Review the resource wait policy, then run again.
zh_hans: 检查资源等待策略后重新运行。

source: Review the wait condition and timeout policy.
zh_hans: 检查等待条件和超时策略。

source: Run filter
zh_hans: 运行筛选

source: Run history
zh_hans: 运行历史

source: Runs
zh_hans: 运行记录

source: Select a run
zh_hans: 选择一条运行记录

source: Showing last loaded runs
zh_hans: 正在显示上次加载的记录

source: Status / failures
zh_hans: 状态 / 失败

source: Steps
zh_hans: 步骤

source: Steps and attempts
zh_hans: 步骤与尝试

source: Succeeded
zh_hans: 成功

source: This active state is available from the running app and is not yet crash-recoverable.
zh_hans: 此活动状态来自当前运行中的应用，异常退出后暂时无法恢复。

source: Total
zh_hans: 总计

source: Updated %@
zh_hans: 更新于 %@

source: Wait for completion or cancel from Workflow.
zh_hans: 等待完成，或在工作流中取消。

source: Check available disk space and Application Support access, then run again.
zh_hans: 检查可用磁盘空间和 Application Support 访问权限后重新运行。

source: Live actions were stopped
zh_hans: 实时操作已停止

source: Run data could not be saved
zh_hans: 运行数据无法保存
